# Неделя 6, День 1 - Рекурсия: база
#
# Задание 1:
# Реализуй factorial(n).
#
# Задание 2:
# Реализуй count_down(n) -> список [n, n-1, ..., 1].
#
# Задание 3:
# Реализуй power_of_two(n) -> 2^n через рекурсию.


def factorial(n: int) -> int:
    return -1



def count_down(n: int) -> list[int]:
    return []



def power_of_two(n: int) -> int:
    return -1


if __name__ == "__main__":
    print(factorial(5))
    print(count_down(5))
    print(power_of_two(6))
    print("Реализуй базовые рекурсивные функции.")
