# Неделя 1, День 5 - Встроенные структуры Python для алгоритмов
#
# Задание 1:
# Реализуй unique_count(items) -> количество уникальных элементов.
#
# Задание 2:
# Реализуй frequency_map(items) -> dict с частотами.
#
# Задание 3:
# Реализуй pair_lists(left, right) -> список пар через zip().


def unique_count(items: list[int]) -> int:
    return -1



def frequency_map(items: list[str]) -> dict[str, int]:
    return {}



def pair_lists(left: list[str], right: list[int]) -> list[tuple[str, int]]:
    return []


if __name__ == "__main__":
    print(unique_count([1, 1, 2, 3, 3]))
    print(frequency_map(["a", "b", "a"]))
    print(pair_lists(["ann", "bob"], [1, 2]))
    print("Используй built-in структуры вместо лишней ручной логики.")
