# Неделя 2, День 5 - Делители и факторизация
#
# Задание 1:
# Реализуй divisors(n) -> отсортированный список делителей.
#
# Задание 2:
# Реализуй prime_factorization(n) -> список простых множителей.
#
# Задание 3:
# Реализуй count_divisors(n) -> количество делителей.


def divisors(n: int) -> list[int]:
    return []



def prime_factorization(n: int) -> list[int]:
    return []



def count_divisors(n: int) -> int:
    return -1


if __name__ == "__main__":
    print(divisors(24))
    print(prime_factorization(90))
    print(count_divisors(24))
    print("Реализуй функции делителей и факторизации.")
