# Неделя 8, День 6 - Подготовка финального проекта
#
# Задание 1:
# Составь список из 4-6 функций, которые войдут в финальный toolkit.
#
# Задание 2:
# Для каждой функции коротко подпиши, из какой темы она взята.
#
# Задание 3:
# Определи, какой demo flow покажет проект в main().


TOOLKIT_PLAN = [
    # TODO: добавь сюда имена функций строками
]


TOPIC_MAP = {
    # TODO: "function_name": "topic"
}


if __name__ == "__main__":
    print(TOOLKIT_PLAN)
    print(TOPIC_MAP)
    print("Ожидается: Итог: план должен покрывать минимум 5 функций из разных блоков курса")
    print("Подготовь список функций для финального toolkit.")
