# Неделя 5, День 1 - Стек
#
# Задание 1:
# Реализуй reverse_string(text) через стек.
#
# Задание 2:
# Реализуй remove_last_two(items),
# которая снимает со стека два последних элемента.
#
# Задание 3:
# Реализуй stack_sum(items), которая суммирует элементы,
# снимая их со стека.


def reverse_string(text: str) -> str:
    return ""



def remove_last_two(items: list[int]) -> list[int]:
    return []



def stack_sum(items: list[int]) -> int:
    return -1


if __name__ == "__main__":
    print(reverse_string("stack"))
    print(remove_last_two([1, 2, 3, 4]))
    print(stack_sum([5, 6, 7]))
    print("Реализуй задачи на базовый стек.")
