# Неделя 4, День 4 - Префиксные суммы
#
# Задание 1:
# Реализуй build_prefix_sums(items).
#
# Задание 2:
# Реализуй range_sum(prefix, left, right).
#
# Задание 3:
# Реализуй count_positives_prefix(items),
# где prefix хранит количество положительных элементов до позиции.


def build_prefix_sums(items: list[int]) -> list[int]:
    return []



def range_sum(prefix: list[int], left: int, right: int) -> int:
    return -1



def count_positives_prefix(items: list[int]) -> list[int]:
    return []


if __name__ == "__main__":
    sample = [3, -1, 2, 0, 5]
    print(build_prefix_sums(sample))
    print(range_sum([3, 2, 4, 4, 9], 1, 3))
    print(count_positives_prefix(sample))
    print("Реализуй задачи на префиксные суммы.")
