# Неделя 3, День 2 - Простые сортировки
#
# Задание 1:
# Реализуй bubble_sort(items).
#
# Задание 2:
# Реализуй insertion_sort(items).
#
# Задание 3:
# Подпиши сложность обеих сортировок в комментариях.


def bubble_sort(items: list[int]) -> list[int]:
    # TODO: O(?)
    return []



def insertion_sort(items: list[int]) -> list[int]:
    # TODO: O(?)
    return []


if __name__ == "__main__":
    sample = [9, 3, 7, 1]
    print(bubble_sort(sample))
    print(insertion_sort(sample))
    print("Ожидается: bubble_sort = [1, 3, 7, 9], insertion_sort = [1, 3, 7, 9]")
    print("Реализуй учебные сортировки.")
