# Неделя 1, День 1 - Что такое алгоритм
#
# Задание 1:
# Напиши функцию count_negative(numbers), которая считает,
# сколько отрицательных чисел в списке.
#
# Задание 2:
# Напиши функцию first_even(numbers), которая возвращает
# первое чётное число или None, если его нет.
#
# Задание 3:
# Перед каждой функцией кратко опиши алгоритм в 2-4 шагах.


def count_negative(numbers: list[int]) -> int:
    # TODO: опиши алгоритм шагами
    return -1



def first_even(numbers: list[int]) -> int | None:
    # TODO: опиши алгоритм шагами
    return None


if __name__ == "__main__":
    data = [3, -5, 8, -1, 0]
    print("count_negative:", count_negative(data))
    print("first_even:", first_even(data))
    print("Реализуй функции и замени временные результаты.")
