# Неделя 2, День 6 - Практика на числовые задачи
#
# Задание 1:
# Реализуй are_coprime(a, b).
#
# Задание 2:
# Реализуй has_prime_in_range(left, right).
#
# Задание 3:
# Реализуй count_numbers_divisible_by_any(numbers, a, b).
# Нужно посчитать, сколько чисел делятся на a или на b.


def are_coprime(a: int, b: int) -> bool:
    return False



def has_prime_in_range(left: int, right: int) -> bool:
    return False



def count_numbers_divisible_by_any(numbers: list[int], a: int, b: int) -> int:
    return -1


if __name__ == "__main__":
    print(are_coprime(14, 25))
    print(has_prime_in_range(14, 20))
    print(count_numbers_divisible_by_any([6, 10, 15, 21, 22], 2, 3))
    print("Выбери правильные числовые алгоритмы для каждой задачи.")
