# Неделя 3, День 1 - Two Pointers
#
# Задание 1:
# Реализуй has_pair_with_sum_sorted(items, target).
#
# Задание 2:
# Реализуй is_palindrome(text).
#
# Задание 3:
# Реализуй remove_duplicates_sorted(items),
# которая возвращает новый список без дубликатов в отсортированном массиве.


def has_pair_with_sum_sorted(items: list[int], target: int) -> bool:
    return False



def is_palindrome(text: str) -> bool:
    return False



def remove_duplicates_sorted(items: list[int]) -> list[int]:
    return []


if __name__ == "__main__":
    print(has_pair_with_sum_sorted([1, 2, 4, 7, 9], 11))
    print(is_palindrome("radar"))
    print(remove_duplicates_sorted([1, 1, 2, 2, 3, 4, 4]))
    print("Ожидается: has_pair_with_sum_sorted = True, is_palindrome = True, remove_duplicates_sorted = [1, 2, 3, 4]")
    print("Реализуй задачи на паттерн two pointers.")
