# Неделя 5, День 2 - Очередь и deque
#
# Задание 1:
# Реализуй first_processed(items), которая возвращает
# первый обработанный элемент из очереди.
#
# Задание 2:
# Реализуй rotate_left_once(items) через deque.
#
# Задание 3:
# Реализуй queue_sum(items),
# которая суммирует элементы очереди по FIFO.


def first_processed(items: list[str]) -> str | None:
    return None



def rotate_left_once(items: list[int]) -> list[int]:
    return []



def queue_sum(items: list[int]) -> int:
    return -1


if __name__ == "__main__":
    print(first_processed(["job-1", "job-2"]))
    print(rotate_left_once([1, 2, 3, 4]))
    print(queue_sum([3, 5, 7]))
    print("Реализуй задачи на очередь и deque.")
