# Неделя 3, День 6 - Практика на поиск и сортировки
#
# Задание 1:
# Реализуй sort_and_deduplicate(items).
#
# Задание 2:
# Реализуй insertion_position(items, target) для отсортированного списка.
#
# Задание 3:
# Реализуй top_k_smallest(items, k) через сортировку.


def sort_and_deduplicate(items: list[int]) -> list[int]:
    return []



def insertion_position(items: list[int], target: int) -> int:
    return -1



def top_k_smallest(items: list[int], k: int) -> list[int]:
    return []


if __name__ == "__main__":
    print(sort_and_deduplicate([3, 1, 3, 2, 2]))
    print(insertion_position([1, 3, 5, 7], 4))
    print(top_k_smallest([8, 2, 5, 1, 9, 3], 3))
    print("Ожидается: sort_and_deduplicate = [1, 2, 3], insertion_position = 2, top_k_smallest = [1, 2, 3]")
    print("Реализуй смешанные задачи по поиску и сортировкам.")
