# Неделя 2, День 4 - Решето Эратосфена
#
# Задание 1:
# Реализуй sieve(limit) -> список всех простых чисел до limit.
#
# Задание 2:
# Реализуй count_primes_up_to(limit).
#
# Задание 3:
# Реализуй sum_primes_up_to(limit).


def sieve(limit: int) -> list[int]:
    return []



def count_primes_up_to(limit: int) -> int:
    return -1



def sum_primes_up_to(limit: int) -> int:
    return -1


if __name__ == "__main__":
    print(sieve(20))
    print(count_primes_up_to(20))
    print(sum_primes_up_to(20))
    print("Реализуй решето и функции на его основе.")
