# День 2 — Практика: переменные и типы данных

# Задание 1
# Создай переменные для описания тестировщика:
#   имя (str), возраст (int), опыт в годах (float),
#   работает ли сейчас (bool)
# Выведи все переменные и их типы через type()
# Пример вывода:
#   Имя: Sergey <class 'str'>
#   Возраст: 25 <class 'int'>
#   ...
#
# Напиши код здесь:


# Задание 2
# Посчитай и выведи результаты:
#   - Сколько часов в 9 неделях? (9 недель * 7 дней * 4 часа)
#   - Сколько минут в этих часах?
#   - Остаток от деления 253 на 7
# Используй f-строки для вывода.
#
# Напиши код здесь:


# Задание 3
# Дана строка: age_str = "28"
# Преобразуй её в int и выполни арифметику:
#   через 5 лет тебе будет X лет
# Выведи: "Сейчас: 28. Через 5 лет: 33"
#
# Напиши код здесь:

age_str = "28"


# Задание 4
# Что выведет этот код? Ответь комментарием ПЕРЕД запуском,
# потом проверь запустив файл.
#
print(type(True))
print(type(None))
print(10 // 3)
print(10 % 3)
print(bool(0))
print(bool(100))
# Мои ответы (напиши здесь до запуска):
#
