# Неделя 3, День 4 - Быстрая сортировка
#
# Задание 1:
# Реализуй quick_sort(items) в учебной версии через less/equal/greater.
#
# Задание 2:
# Подпиши среднюю и худшую сложность в комментариях.
#
# Задание 3:
# Коротко ответь в комментарии:
# чем quick sort концептуально отличается от merge sort?


def quick_sort(items: list[int]) -> list[int]:
    # TODO: average O(?), worst O(?)
    return []


if __name__ == "__main__":
    print(quick_sort([4, 1, 7, 3, 2, 9]))
    print("Реализуй quick sort в учебной форме.")
