# Неделя 6, День 2 - Divide and Conquer
#
# Задание 1:
# Реализуй sum_divide_and_conquer(items).
#
# Задание 2:
# Реализуй max_divide_and_conquer(items).
#
# Задание 3:
# Коротко ответь в комментарии:
# что в твоём решении является divide, conquer и combine?


def sum_divide_and_conquer(items: list[int]) -> int:
    return -1



def max_divide_and_conquer(items: list[int]) -> int:
    return -1


if __name__ == "__main__":
    sample = [4, 8, 1, 7, 2, 9]
    print(sum_divide_and_conquer(sample))
    print(max_divide_and_conquer(sample))
    print("Реализуй divide and conquer решения.")
